# 02_Transform(T)

In [2]:
import pandas as pd

## Load heights_weights

In [13]:
df_hw = pd.read_csv("data/heights_weights.csv")
df_hw

     name  height_inch  weight_lb
0     Ana           65        121
1  Carlos           70        176
2   Lucía           63        110
3   Pedro           69        198
4   María           62        115

In [14]:
df_hw.head(2)

     name  height_inch  weight_lb
0     Ana           65        121
1  Carlos           70        176

In [15]:
df_hw.shape

(5, 3)

In [16]:
df_hw.dtypes

name           object
height_inch     int64
weight_lb       int64
dtype: object

## Create new columns with metric units

In [25]:
df_hw["height_m"] = (df_hw["height_inch"] * 0.0254).round(2)
df_hw["weight_kg"] = (df_hw["weight_lb"] * 0.45359237).round(2)
df_hw

     name  height_inch  weight_lb  height_m  weight_kg    bmi
0     Ana           65        121      1.65      54.88  20.16
1  Carlos           70        176      1.78      79.83  25.20
2   Lucía           63        110      1.60      49.90  19.49
3   Pedro           69        198      1.75      89.81  29.33
4   María           62        115      1.57      52.16  21.16

## Create BMI Column (Body Mass Index)

In [23]:
df_hw["bmi"] = (df_hw["weight_kg"] / (df_hw["height_m"] ** 2)).round(2)
df_hw

     name  height_inch  weight_lb  height_m  weight_kg    bmi
0     Ana           65        121      1.65      54.88  20.16
1  Carlos           70        176      1.78      79.83  25.20
2   Lucía           63        110      1.60      49.90  19.49
3   Pedro           69        198      1.75      89.81  29.33
4   María           62        115      1.57      52.16  21.16

## Load dirty_data

In [28]:
df_dirty = pd.read_csv("data/dirty_data.csv")
df_dirty

      name               email   age  country
0    ana      ANA@EXAMPLE.COM   23.0   spain
1   CARLOS  carlos@example.com   NaN    Spain
2    Lucía  lucia@@example.com  27.0    SPAIN
3   Pedro    pedro@example.com  44.0   España
4    María  maria@example.com   19.0    spain
5   CARLOS  carlos@example.com   NaN    Spain

In [29]:
df_dirty.head(2)

      name               email   age country
0    ana      ANA@EXAMPLE.COM   23.0  spain
1   CARLOS  carlos@example.com   NaN   Spain

In [30]:
df_dirty.dtypes

name        object
email       object
age        float64
country     object
dtype: object

In [31]:
df_dirty.isnull().sum()

name       0
email      0
age        2
country    0
dtype: int64

## Cleaning Spaces , Capital Letters And Null Spaces

### Name Column

#### Remove leading and trailing spaces = .strip()
#### Capitalize the first letter = .title() or .capitalize()

In [38]:
df_dirty["name"] = df_dirty["name"].str.strip().str.capitalize()
df_dirty["name"]

0       Ana
1    Carlos
2     Lucía
3     Pedro
4     María
5    Carlos
Name: name, dtype: object

### Email Column

#### Remove leading and trailing spaces = .strip() 
#### Convert all letters to lowercase = .lower()

In [40]:
df_dirty["email"] = df_dirty["email"].str.strip().str.lower()
df_dirty["email"]

0       ana@example.com
1    carlos@example.com
2    lucia@@example.com
3     pedro@example.com
4     maria@example.com
5    carlos@example.com
Name: email, dtype: object

## Clean all country values so they are in the same format

In [41]:
df_dirty

     name               email   age  country
0     Ana     ana@example.com  23.0   spain
1  Carlos  carlos@example.com   NaN    Spain
2   Lucía  lucia@@example.com  27.0    SPAIN
3   Pedro   pedro@example.com  44.0   España
4   María   maria@example.com  19.0    spain
5  Carlos  carlos@example.com   NaN    Spain

In [44]:
df_dirty["country"] = df_dirty["country"].replace({"España" : "Spain"})
df_dirty["country"] = df_dirty["country"].str.strip().str.title()

In [45]:
df_dirty

     name               email   age country
0     Ana     ana@example.com  23.0   Spain
1  Carlos  carlos@example.com   NaN   Spain
2   Lucía  lucia@@example.com  27.0   Spain
3   Pedro   pedro@example.com  44.0   Spain
4   María   maria@example.com  19.0   Spain
5  Carlos  carlos@example.com   NaN   Spain

## Handling null values in Age

### See how many nulls there are in age

In [48]:
df_dirty[["age"]]

    age
0  23.0
1   NaN
2  27.0
3  44.0
4  19.0
5   NaN

### Fill nulls with a fixed value (e.g. 0 or 18).

In [50]:
# Select in df_dirty the ROWS where the column "age" is null
# df_dirty["age"].isna() → returns True only for rows with NaN
# Then, inside those rows, select ONLY the "age" column
df_dirty.loc[df_dirty["age"].isna(), "age"] = [18,40]

# Explanation of each part:

# df_dirty
#   → this is the DataFrame we are working with.

# .loc[ rows , column ]
#   → .loc allows selecting rows and columns using labels or conditions.

# df_dirty["age"].isna()
#   → returns a boolean series:
#       True  for rows where age is NaN
#       False for rows where age has a number

# df_dirty.loc[df_dirty["age"].isna(), "age"]
#   → selects ONLY the "age" column, BUT only in the rows where age is null.

# = [18,40]
#   → assigns a list of NEW values to the null entries.
#   → IMPORTANT: the number of values must match the number of nulls.
#   → Example: if there are 4 nulls, this list must contain 4 values.

In [51]:
df_dirty[["age"]]

    age
0  23.0
1  18.0
2  27.0
3  44.0
4  19.0
5  40.0

## Remove duplicate rows from the DataFrame df_dirty

In [54]:
df_dirty

     name               email   age country
0     Ana     ana@example.com  23.0   Spain
1  Carlos  carlos@example.com  18.0   Spain
2   Lucía  lucia@@example.com  27.0   Spain
3   Pedro   pedro@example.com  44.0   Spain
4   María   maria@example.com  19.0   Spain
5  Carlos  carlos@example.com  40.0   Spain

In [55]:
df_dirty.shape

(6, 4)

In [57]:
df_dirty = df_dirty.drop_duplicates()
df_dirty

     name               email   age country
0     Ana     ana@example.com  23.0   Spain
1  Carlos  carlos@example.com  18.0   Spain
2   Lucía  lucia@@example.com  27.0   Spain
3   Pedro   pedro@example.com  44.0   Spain
4   María   maria@example.com  19.0   Spain
5  Carlos  carlos@example.com  40.0   Spain

## Create a final clean DataFrame

### 1. Select the columns to keep

In [62]:
columns_to_keep = ["name", "email", "age"]

### 2. Create the clean DataFrame

In [63]:
df_clean = df_dirty[columns_to_keep].copy()

### 3. Display the first rows

In [65]:
df_clean.head()

     name               email   age
0     Ana     ana@example.com  23.0
1  Carlos  carlos@example.com  18.0
2   Lucía  lucia@@example.com  27.0
3   Pedro   pedro@example.com  44.0
4   María   maria@example.com  19.0

### 4. Display data types

In [66]:
df_clean.dtypes

name      object
email     object
age      float64
dtype: object

## Create a transform_data() Function

In [69]:
def transform_data():
    # 1. Read heights_weights.csv
    df_hw = pd.read_csv("data/heights_weights.csv")
    
    # 2. Convert to metric units
    df_hw["height_m"] = df_hw["height_in"] * 0.0254
    df_hw["weight_kg"] = df_hw["weight_lb"] * 0.453592
    
    # 3. Calculate BMI
    df_hw["bmi"] = df_hw["weight_kg"] / (df_hw["height_m"] ** 2)
    
    # 4. Read dirty_data.csv
    df_dirty = pd.read_csv("data/dirty_data.csv")
    
    # 5. Clean name, email, country, null values and duplicates
    df_dirty["name"] = df_dirty["name"].str.strip().str.title()
    df_dirty["email"] = df_dirty["email"].str.strip().str.lower()
    df_dirty["country"] = df_dirty["country"].str.strip().str.title()
    
    # Remove rows with null values in important columns
    df_dirty = df_dirty.dropna(subset=["name", "email", "age", "country"])
    
    # Remove duplicate rows
    df_dirty = df_dirty.drop_duplicates()
    
    # Final clean dataframe
    df_clean = df_dirty[["name", "email", "age", "country"]]
    
    return df_hw, df_clean

In [74]:
result = transform_data()
result

KeyError: 'height_in'